PROTOCOL = {
    "diagnostic": {
        "questions": [
            {"type": "button", "text": "Я хорошо умею противостоять соблазнам.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Мне трудно избавляться от вредных привычек.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Я ленивый.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Я говорю вещи, которые неуместны.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Я делаю вещи, которые приносят удовольствие, но вредят мне.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Люди говорят, что у меня железная самодисциплина.", "options": [1,2,3,4,5]},
            {"type": "button", "text": "Я часто действую, не обдумав все варианты.", "options": [1,2,3,4,5]}
        ]
    },
    "level1": {
        "days": [
            {
                "day": 1,
                "questions": [
                    {"type": "button", "text": "Сегодня я легко отвлеклась от важного дела.", "options": [1,2,3,4,5]},
                    {"type": "button", "text": "Я часто действую импульсивно.", "options": [1,2,3,4,5]},
                    {"type": "button", "text": "Мне трудно отказаться от вредных привычек.", "options": [1,2,3,4,5]},
                    {"type": "button", "text": "Я обычно выполняю свои планы, даже если они сложные.", "options": [1,2,3,4,5]},
                    {"type": "button", "text": "Я часто говорю себе 'сделаю это завтра'.", "options": [1,2,3,4,5]}
                ]
            }
        ]
    }
}